brew "automake"
brew "git"
brew "git-extras"
brew "the_silver_searcher"
brew "ripgrep"
brew "jq"
brew "yq"
brew "tree"
brew "shellcheck"
brew "sheldon"
brew "starship"
brew "graphviz"
brew "mkcert"
brew "nss"
brew "zig"
brew "ctags"
brew "docker"
brew "colima"
brew "mise"

cask "hammerspoon"

tap "sqldef/sqldef", trusted: true
brew "sqldef/sqldef/mysqldef", trusted: true

tap "railwaycat/emacsmacport", trusted: true
cask "emacs-mac", trusted: true

cask "claude-code"
