brew "automake"
brew "rbenv"
brew "fnm"
brew "git"
brew "git-extras"
brew "the_silver_searcher"
brew "ripgrep"
brew "jq"
brew "yq"
brew "tree"
brew "shellcheck"
brew "starship"
brew "graphviz"
brew "mkcert"
brew "nss"
brew "zig"
brew "ctags"

cask "hammerspoon"

tap "sqldef/sqldef"
brew "sqldef/sqldef/mysqldef"

tap "railwaycat/emacsmacport"
cask "emacs-mac"
